import { Box, Text } from '@chakra-ui/react'
import React from 'react'
import styles from './styles.module.scss'
import Image from 'next/image'
import offertaImg from "../../../public/oferta.svg";

const Offers = () => {
  return (
    <Box className={styles.container}>
      <Box className={styles.offer_wrapper}>
        <Text className={styles.public_title}>Публичная оферта</Text>
        <Box className={styles.offer}>

           <Box className={styles.offer_immage}>
            <Image
            src={offertaImg}
            alt="Публичная оферта"
            width={800}
            height={600}
          />
            </Box>
          
          <Box className={styles.body}>

            <Box id='terms' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>Термины и понятия</Text>
              <Text className={styles.offerta_text}>Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума продолжи работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжи работы. В технологии цифрового </Text>
            </Box>

            <Box id='subject' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>1.
                Предмет договора</Text>
              <Text className={styles.offerta_text}>1.1. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума продолжи работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжи работы. В технологии цифрового
                1.2. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                1.3. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                1.4. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                1.5. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    </Text>
            </Box>

            <Box id='connection' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>2.
                Подключение HAMMA premium</Text>
              <Text className={styles.offerta_text}>3.3.1. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    
3.3.2. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    
3.3.3. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    
3.3.4. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    </Text>
            </Box>

            <Box id='rights' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>3.1. Заказчик обязан</Text>
              <Text className={styles.offerta_text}>2.1. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума продолжи работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжи работы. В технологии цифрового
                2.2. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                2.3. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                2.4. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума продолжи работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжи работы. В технологии цифрового
                2.5. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    </Text>
            </Box>
            <Box id='liability' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>3.2. Исполнитель обязан</Text>
              <Text className={styles.offerta_text}>3.1. Заказчик обязан
                3.1.1. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума продолжи работы. В технологии цифрового
                Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжи работы. В технологии цифрового
                3.1.2. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                3.1.3. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                3.1.4. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    </Text>
            </Box>
            <Box id='final ' className={styles.offerta_body}>
              <Text className={styles.offerta_title}>3.3. Права заказчика</Text>
              <Text className={styles.offerta_text}>3.2.1. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                3.2.2. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                3.2.3. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.
                3.2.4. Наслаждайтесь повышенной энергоэффективностью, пониженным уровнем шума и продолжительностью работы. В технологии цифрового инвертора используют мощные магниты, увеличивающие мощность. Но такое устройство работает тише и потребляет меньше энергии, чем универсальный электродвигатель.    </Text>
            </Box>
          </Box>
        </Box>
      </Box>
      <Box className={styles.sidebar}>
        <Text className={styles.sidebar_title}>Содержание:</Text>
        <ul>
          <li><a href="#terms">Термины и понятия</a></li>
          <li><a href="#subject">Предмет договора</a></li>
          <li><a href="#connection">Подключение Hamma Plus</a></li>
          <li><a href="#rights">Порядок оплаты, права и обязанности сторон</a></li>
          <li><a href="#liability">Ответственность сторон</a></li>
          <li><a href="#final">Заключительные положения</a></li>
        </ul>
      </Box>
    </Box>
  )
}

export default Offers 